{
  "book": "Ephesians",
  "chapters": [
{
  "chapter": "1",
  "verses": [
    {
      "verse": "1",
      "text": "Paul, an apostle of Jesus by God’s will — sending love and peace to the squad in Ephesus."
    },
    {
      "verse": "2",
      "text": "Grace and peace from God our Father and the Lord Jesus. Big energy, for real."
    },
    {
      "verse": "3",
      "text": "Blessed be God, the Father of our Lord Jesus — He hooked us up with every spiritual blessing in heavenly realms."
    },
    {
      "verse": "4",
      "text": "God picked us before the world began, holy and flawless in His eyes, set us up to be adopted as His kids."
    },
    {
      "verse": "5",
      "text": "He did it through Jesus, according to His plan, to flex His own will and purpose."
    },
    {
      "verse": "6",
      "text": "This was all for His glory — He’s always about that glory."
    },
    {
      "verse": "7",
      "text": "Through Jesus, we got redemption — our sins canceled out — and full forgiveness by His grace."
    },
    {
      "verse": "8",
      "text": "God poured His crazy lavish grace on us, full-on wisdom and understanding energy."
    },
    {
      "verse": "9",
      "text": "He revealed to us the mystery of His will — what He planned all along in Christ."
    },
    {
      "verse": "10",
      "text": "The plan? To unite everything in heaven and earth under Christ. Full squad energy."
    },
    {
      "verse": "11",
      "text": "In Him we got our inheritance — chosen according to His plan, so He can do what He wants."
    },
    {
      "verse": "12",
      "text": "We exist to flex His glory — we hope and trust in Christ before Him."
    },
    {
      "verse": "13",
      "text": "You heard the gospel, believed it, and got sealed with the Holy Spirit — guaranteed deposit of what’s coming."
    },
    {
      "verse": "14",
      "text": "The Spirit is a promise of our inheritance, ensuring we hit that ultimate flex on the Last Day."
    },
    {
      "verse": "15",
      "text": "That’s why I keep thanking God for y’all, remembering you in my prayers."
    },
    {
      "verse": "16",
      "text": "I pray the Spirit gives you wisdom and revelation in knowing Him — full knowledge, no cap."
    },
    {
      "verse": "17",
      "text": "That your hearts get lit up to understand the hope He called you to."
    },
    {
      "verse": "18",
      "text": "To grasp the insane wealth of God’s inheritance for His saints."
    },
    {
      "verse": "19",
      "text": "To see how unreal God’s power is for us believers — like resurrection-level strength, working in Christ."
    },
    {
      "verse": "20",
      "text": "This same power raised Jesus from the dead and sat Him at God’s right hand in heavenly realms."
    },
    {
      "verse": "21",
      "text": "Above every rule, authority, power, dominion, and every name you can name — past, present, or future."
    },
    {
      "verse": "22",
      "text": "God put everything under His feet and made Him head over the church,"
    },
    {
      "verse": "23",
      "text": "Which is His body — full unity, full control, full glory."
    }]},
    {
  "chapter": "2",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, you used to be dead in your sins, vibing with the world, following the devil’s energy."
    },
    {
      "verse": "2",
      "text": "He was running the show — the spirit of disobedience in everyone, just living for the hype, not God."
    },
    {
      "verse": "3",
      "text": "All of us were once living like that, chasing fleshly cravings, angry, greedy — full squad against God."
    },
    {
      "verse": "4",
      "text": "But God, rich in mercy, big love energy,"
    },
    {
      "verse": "5",
      "text": "Made us alive with Christ even when we were dead — total glow-up by grace. You got saved."
    },
    {
      "verse": "6",
      "text": "He raised us with Him, seated us with Jesus in heavenly realms — next-level access, no flex."
    },
    {
      "verse": "7",
      "text": "That He might show in ages to come the insane riches of His grace toward us in Christ."
    },
    {
      "verse": "8",
      "text": "Facts: you got saved by grace, not by works — no one can flex and claim credit."
    },
    {
      "verse": "9",
      "text": "Not by works — it’s a gift, fam, so nobody can clout chase over you."
    },
    {
      "verse": "10",
      "text": "We are God’s masterpiece, created in Christ Jesus for good works He prepared beforehand — live them out, don’t ghost."
    },
    {
      "verse": "11",
      "text": "Yo, remember your past? You were separate from Christ, excluded from Israel’s squad, strangers to covenants, no hope, no God."
    },
    {
      "verse": "12",
      "text": "Now? You who were once far have been brought near by the blood of Christ."
    },
    {
      "verse": "13",
      "text": "He’s our bridge — peace energy connecting Jews and Gentiles in one squad."
    },
    {
      "verse": "14",
      "text": "Jesus broke down the wall — hate, division, rules — in His flesh. He made peace."
    },
    {
      "verse": "15",
      "text": "He united both groups into one new person — ending hostility,"
    },
    {
      "verse": "16",
      "text": "And through the cross, He killed the beef between them, bringing God and humans together."
    },
    {
      "verse": "17",
      "text": "He came and preached peace to y’all far away and those near — full squad gospel."
    },
    {
      "verse": "18",
      "text": "Through Him, we both have access to the Father by one Spirit — VIP pass."
    },
    {
      "verse": "19",
      "text": "So no longer strangers or outsiders, we’re now citizens with the saints and part of God’s household."
    },
    {
      "verse": "20",
      "text": "Built on apostles and prophets, Christ Jesus is the cornerstone — solid, unshakeable."
    },
    {
      "verse": "21",
      "text": "In Him, the whole building grows into a holy temple in the Lord."
    },
    {
      "verse": "22",
      "text": "You too are being built together into God’s dwelling, full of Spirit vibes."
    }]},
    {
  "chapter": "3",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, it’s Paul — lowkey locked up for Christ, but trust, I’m on a divine mission, no chill."
    },
    {
      "verse": "2",
      "text": "God slid me a secret, mad hidden before — now it’s fully out, big energy."
    },
    {
      "verse": "3",
      "text": "Gentiles? Yeah, they’re officially part of the squad — full inclusion, no exclusions."
    },
    {
      "verse": "4",
      "text": "Through the Spirit, I can spill the blueprint — God’s plan for humanity unlocked."
    },
    {
      "verse": "5",
      "text": "It was ghosted from past generations, but now? Revealed. Major glow-up."
    },
    {
      "verse": "6",
      "text": "The mystery? Gentiles share the same inheritance, same body, same promise in Christ — we all one fam."
    },
    {
      "verse": "7",
      "text": "I got mad grace to preach this — dropping knowledge on the hidden plan, no cap."
    },
    {
      "verse": "8",
      "text": "Me? The tiniest apostle ever, but God’s grace hit hard — now I’m grinding full-time."
    },
    {
      "verse": "9",
      "text": "My job: show everyone the hidden mystery God had from the jump."
    },
    {
      "verse": "10",
      "text": "Spiritual powers, heavenly squads? They see God’s wisdom flexed through the church — totally cosmic energy."
    },
    {
      "verse": "11",
      "text": "His eternal plan? Fully executed in Christ Jesus — all things finally make sense."
    },
    {
      "verse": "12",
      "text": "Through Him, we approach God confident, no gatekeeping, no awkward vibes."
    },
    {
      "verse": "13",
      "text": "So don’t get shook by my jail sitch — it’s all part of God’s ultimate grind."
    },
    {
      "verse": "14",
      "text": "I drop to my knees, hands up in heaven’s energy."
    },
    {
      "verse": "15",
      "text": "For the squad — every family in heaven and on earth — God gets mad glory."
    },
    {
      "verse": "16",
      "text": "Pray He fills you with power through His Spirit, deep in your inner core."
    },
    {
      "verse": "17",
      "text": "Christ vibing in your heart, anchoring you in love, stable, unshakeable."
    },
    {
      "verse": "18",
      "text": "Rooted, grounded — love maxed, faith un-wobbly, fully stacked."
    },
    {
      "verse": "19",
      "text": "Feel it: width, length, height, depth of God’s love — impossible to measure, but fully lit."
    },
    {
      "verse": "20",
      "text": "God can do insane things beyond imagination, through Christ — ultimate power move."
    },
    {
      "verse": "21",
      "text": "To Him be eternal glory in the church, in Christ Jesus — forever. No cap. Amen."
    }]},
    {
  "chapter": "4",
  "verses": [
    {
      "verse": "1",
      "text": "Yo, I, Paul, lowkey chained, but I’m calling y’all to live worthy — squad vibes, humble and chill."
    },
    {
      "verse": "2",
      "text": "Stay patient, loving each other, keep the peace — unity energy unlocked."
    },
    {
      "verse": "3",
      "text": "One squad, one Spirit, one baptism, one God — all for the same glory."
    },
    {
      "verse": "4",
      "text": "One Lord, one faith, one hope — don’t get it twisted."
    },
    {
      "verse": "5",
      "text": "God’s squad is bigger than you think — all part of the same mission."
    },
    {
      "verse": "6",
      "text": "Grace flows from the Father to everyone — no exceptions, full drip."
    },
    {
      "verse": "7",
      "text": "Each of us gets grace in different measures — God flexing diversity."
    },
    {
      "verse": "8",
      "text": "He ascended, led captives, gave gifts to the squad — full energy pass-down."
    },
    {
      "verse": "9",
      "text": "Ascension flex: He went up high, and took low-key spirits along."
    },
    {
      "verse": "10",
      "text": "Now He gives leaders — apostles, prophets, evangelists, pastors, teachers — to squad up."
    },
    {
      "verse": "11",
      "text": "Their job? Equip the squad, prepare the saints for full mission vibes."
    },
    {
      "verse": "12",
      "text": "Build the squad, reach maturity — no more baby believers wobbling."
    },
    {
      "verse": "13",
      "text": "Then we all grow, full stature of Christ — max level."
    },
    {
      "verse": "14",
      "text": "No more being tossed by vibes, tricks, or fake news."
    },
    {
      "verse": "15",
      "text": "Speak truth in love — every word hits, no cap."
    },
    {
      "verse": "16",
      "text": "Body vibes together — every part works, grows, builds up, stable squad energy."
    },
    {
      "verse": "17",
      "text": "Drop the old vibes — no more lying, no deceit, no fake clout."
    },
    {
      "verse": "18",
      "text": "Mind reset: don’t wander in darkness, ignorance, hype without truth."
    },
    {
      "verse": "19",
      "text": "Past life? Full chaos — greed, anger, empty chatter."
    },
    {
      "verse": "20",
      "text": "But now? Learn Christ, do truth, speak life."
    },
    {
      "verse": "21",
      "text": "Don’t let old ways ghost you; put off old self — full unlearn."
    },
    {
      "verse": "22",
      "text": "Put on the new self — renewed in knowledge, God energy maxed."
    },
    {
      "verse": "23",
      "text": "Think right, live right, squad goals synced with Creator."
    },
    {
      "verse": "24",
      "text": "Put off lying, slander, corrupt talk — chat light, truth tight."
    },
    {
      "verse": "25",
      "text": "Don’t steal — work with hands, flex for giving, not flexing."
    },
    {
      "verse": "26",
      "text": "Don’t let anger run wild; don’t let sun set on beef."
    },
    {
      "verse": "27",
      "text": "Ghost revenge — leave it to God, squad peace maintained."
    },
    {
      "verse": "28",
      "text": "Don’t let corrupt talk spill — only words that build up."
    },
    {
      "verse": "29",
      "text": "Don’t grieve the Spirit — He’s your squad anchor."
    },
    {
      "verse": "30",
      "text": "Kill old vibes — bitterness, rage, slander, toxic energy."
    },
    {
      "verse": "31",
      "text": "Be kind, tender, forgiving — God forgave you, now you flex it too."
    },
    {
      "verse": "32",
      "text": "Wrap it all up in love — perfect squad energy, full Christ flex."
    }]},
    {
  "chapter": "5",
  "verses": [
    {
      "verse": "1",
      "text": "Squad up, fam — be imitators of God, full-on love flex, just like Christ."
    },
    {
      "verse": "2",
      "text": "Walk the love lane — it’s the ultimate energy move, full sacrifice, full vibe."
    },
    {
      "verse": "3",
      "text": "Keep it clean — no filth, greed, or cap in talk; nothing shady, nothing wild."
    },
    {
      "verse": "4",
      "text": "No foolish chatter, no lame jokes — keep it wholesome, Spirit-aligned."
    },
    {
      "verse": "5",
      "text": "Know this: greed and impurity have zero inheritance in God’s squad."
    },
    {
      "verse": "6",
      "text": "Don’t get tricked — God’s wrath hits hard on liars and frauds."
    },
    {
      "verse": "7",
      "text": "Don’t play with shadows — no part in darkness, no links to fake vibes."
    },
    {
      "verse": "8",
      "text": "Once y’all were lost, now you’re lit in the Lord — walk as light flexers."
    },
    {
      "verse": "9",
      "text": "Light produces every goodness, righteousness, and truth — glow-up mode."
    },
    {
      "verse": "10",
      "text": "Peep what pleases the Lord — test every move, every vibe."
    },
    {
      "verse": "11",
      "text": "Don’t roll with dark vibes; expose the fake, call it out."
    },
    {
      "verse": "12",
      "text": "What’s hidden? Expose it. Stop ignoring it; shine light."
    },
    {
      "verse": "13",
      "text": "Darkness gets exposed by the light — all secrets revealed."
    },
    {
      "verse": "14",
      "text": "Wake up, squad! Rise from sleep — Christ’s light is coming, energy flex!"
    },
    {
      "verse": "15",
      "text": "Watch your step — live smart, not dumb."
    },
    {
      "verse": "16",
      "text": "Time’s tight, don’t waste it; maximize every chance, full purpose."
    },
    {
      "verse": "17",
      "text": "Don’t be idiots — understand the Lord’s will, squad focus."
    },
    {
      "verse": "18",
      "text": "Don’t get wasted on booze — get full Spirit, full energy."
    },
    {
      "verse": "19",
      "text": "Sing psalms, hymns, spiritual songs — vibe in your heart to the Lord."
    },
    {
      "verse": "20",
      "text": "Give thanks always — God sees your grind, recognizes your flex."
    },
    {
      "verse": "21",
      "text": "Submit to each other — squad synergy in reverence to Christ."
    },
    {
      "verse": "22",
      "text": "Wives, vibe with your husbands — Spirit respect, not blind cap."
    },
    {
      "verse": "23",
      "text": "Husbands, lead like Christ — love the squad like His body, no half-stepping."
    },
    {
      "verse": "24",
      "text": "Wives, your husband is the head, same as Christ is head of Church — respect, no disrespect."
    },
    {
      "verse": "25",
      "text": "Husbands, love your wives like Christ — sacrifice fully, no cap."
    },
    {
      "verse": "26",
      "text": "Sanctify the squad, cleanse with truth — spiritual glow-up."
    },
    {
      "verse": "27",
      "text": "Present the squad spotless — full holy energy, zero flaws."
    },
    {
      "verse": "28",
      "text": "Husbands, love your wives like your own body — selfless vibes."
    },
    {
      "verse": "29",
      "text": "No one hates their own body — care, feed, protect."
    },
    {
      "verse": "30",
      "text": "Christ loves the Church — nourishes and cherishes like His own."
    },
    {
      "verse": "31",
      "text": "That’s why man leaves, clings, squad unity — one flesh, one energy."
    },
    {
      "verse": "32",
      "text": "Deep mystery alert: this flex is about Christ and the Church — mind-blown."
    },
    {
      "verse": "33",
      "text": "Husbands and wives? Love and respect, full Spirit synergy, full squad energy."
    }]},
    {
  "chapter": "6",
  "verses": [
    {
      "verse": "1",
      "text": "Kids, vibe with your parents — respect, obey, it’s the move in the Lord."
    },
    {
      "verse": "2",
      "text": "Honor your fam — long life, max blessing, no cap."
    },
    {
      "verse": "3",
      "text": "Parents, don’t snap or roast your kids — raise ‘em right, full patience."
    },
    {
      "verse": "4",
      "text": "Work vibes: slaves, obey your bosses like the Lord, no fake flex."
    },
    {
      "verse": "5",
      "text": "Do it from the heart — serve like it’s Christ you’re flexing for, not humans."
    },
    {
      "verse": "6",
      "text": "Don’t just do it when watched — deep-down, real Spirit energy."
    },
    {
      "verse": "7",
      "text": "Masters, treat your crew right — fairness over flexing or threats."
    },
    {
      "verse": "8",
      "text": "God sees everything — nothing ghosted, every action logged."
    },
    {
      "verse": "9",
      "text": "Squad, suit up — we’re in a battle, not just chill mode."
    },
    {
      "verse": "10",
      "text": "God’s power is your full flex — He makes you strong."
    },
    {
      "verse": "11",
      "text": "Armor up, fam — stand firm against the devil’s tricks."
    },
    {
      "verse": "12",
      "text": "Our fight? Not just humans, it’s spiritual — rulers, powers, forces of darkness."
    },
    {
      "verse": "13",
      "text": "So grab the full armor — stand your ground, no cap retreat."
    },
    {
      "verse": "14",
      "text": "Belt of truth tight, chestplate of righteousness locked."
    },
    {
      "verse": "15",
      "text": "Feet shod with readiness from the gospel — step firm, move fast."
    },
    {
      "verse": "16",
      "text": "Shield of faith — block every flaming arrow, every fake vibe."
    },
    {
      "verse": "17",
      "text": "Helmet of salvation, sword of Spirit — Word of God fully loaded."
    },
    {
      "verse": "18",
      "text": "Pray constantly — all times, every angle, Spirit on full alert."
    },
    {
      "verse": "19",
      "text": "Pray for me too — boldness in dropping God’s truth."
    },
    {
      "verse": "20",
      "text": "I’m locked up, but pray I speak clean, no filter, Spirit guided."
    },
    {
      "verse": "21",
      "text": "Tychicus? I’m sending him — he’ll flex updates and encourage your squad."
    },
    {
      "verse": "22",
      "text": "Peace be with the fam in Christ — grace to all the believers."
    },
    {
      "verse": "23",
      "text": "I, Paul, send my signature, full squad love."
    },
    {
      "verse": "24",
      "text": "Grace be with you all — final flex, no cap, eternal drip."
    }]}
  ]}